// Дано прямокутник зі сторонами висота 70,
// та ширина 100, та два массива з точками
// на координаті осі Х та осі Y.
// Кожна точка проводить лінію до протилежного
// кінця прямокутника. Треба написати функцію,
// яка поверне площу найбільшого прямокутника,
// який утворився в результаті розбиття
// початкового прямокутника цими лініями.
// Точки можуть бути тільки цілі
// числа в діапазоні ширини та висоти
// прямокутника від 1 до (sWidth/sHeigth - 1),
// у будь-якому порядку,
// без повторень.
// Рахуються тільки прямокутники які не були розділені лініями.
// Link: https://drive.google.com/file/d/1h-M4uHyKHh_KowjLj7yaAtVV6RKqWNMc/view?usp=drive_link

const sWidth = 100;
const sHeigth = 70;

export function findBiggestRectangle(x: number[], y: number[]): number {
  return 0;
}
